app/Controllers/Barang.php

SELECT *
FROM `kategori`
---
    public function create()
    {
        $data = [
            'title' => 'Tambah Barang',
            'kategori' => $this->kategori->findAll()

INSERT INTO `barang` (`nama`, `kategori_id`, `harga`, `stok`) VALUES ('pulsa 20rb', '1', '220000', '2')
---
    public function store()
    {
        $this->barang->save($this->request->getPost());

SELECT *
FROM `barang`
WHERE `barang`.`id` = '1'
SELECT *
FROM `kategori`
---
    public function edit($id)
    {
        $data = [
            'title' => 'Edit Barang',
            'barang' => $this->barang->find($id),
            'kategori' => $this->kategori->findAll()

UPDATE `barang` SET `nama` = 'Pulsa 10rb', `kategori_id` = '3', `harga` = '12000.00', `stok` = '1'
WHERE `barang`.`id` IN ('1')
---
    public function update($id)
    {
        $this->barang->update($id, $this->request->getPost());

DELETE FROM `barang`
WHERE `id` IN ('17')
---
    public function delete($id)
    {
        $this->barang->delete($id);

SELECT *
FROM `kategori`
INSERT INTO `barang` (`nama`, `harga`, `stok`, `kategori_id`) VALUES ('Pulsa 20rb', 750000, 0, '1')
---
public function importExcel()
{
    $file = $this->request->getFile('file_excel');
    if ($file->isValid() && !$file->hasMoved()) {
        $newName = $file->getRandomName();
        $file->move(WRITEPATH . 'uploads', $newName);

        $spreadsheet = IOFactory::load(WRITEPATH . 'uploads/' . $newName);
        $sheet = $spreadsheet->getActiveSheet()->toArray();

        // Ambil semua kategori dari database
        $kategoriList = $this->kategori->findAll();
        $kategoriNamaToID = [];
        foreach ($kategoriList as $kat) {
            $kategoriNamaToID[strtolower($kat['nama'])] = $kat['id'];
        }

        foreach ($sheet as $key => $row) {
            if ($key == 0) continue; // Skip baris header

            $namaBarang = trim($row[1] ?? '');
            $namaKategori = strtolower(trim($row[2] ?? ''));
            $harga = (int)($row[3] ?? 0);

            // Konversi nama kategori ke ID
            $kategori_id = $kategoriNamaToID[$namaKategori] ?? null;

            if ($namaBarang !== '' && $kategori_id) {
                $this->barang->save([
                    'nama' => $namaBarang,
                    'harga' => $harga,
                    'stok' => 0, // default karena tidak tersedia di Excel
                    'kategori_id' => $kategori_id
                ]);