app/Models/BarangModel.php

public function getWithKategori()
{
    return $this->select('barang.*, kategori.nama as kategori_nama')
                ->join('kategori', 'kategori.id = barang.kategori_id', 'left')
                ->findAll();
---
SELECT `barang`.*, `kategori`.`nama` as `kategori_nama`
FROM `barang`
LEFT JOIN `kategori` ON `kategori`.`id` = `barang`.`kategori_id`